import React from 'react';

export const taskDesc = <div className={"taskDescDialog"}>
    <p>Самое тяжкое позади. Осталось всего лишь <b>гарантированно</b> включить <span className={"green"}>0'</span> в таблицу, а остальные <span className={"yellow"}>0</span>-ли выбрать по принципу, который представлен во втором задании.</p>
    <p>Ответом как раз и будет тот самый варик, как по-дешёвому раскидать товар по точкам!</p>
    <p>Для проверки нужно передать массив нулей и единиц, как во втором задании. То есть те элементы, что подходят нам по условию в таблице выделяются единицей.</p>
</div>;

export default taskDesc;