export const initialCodeTask1 = "let ribsTable = [\n" +
    "  [6, 2, 5, 7, 3, 6, 6, 5],\n" +
    "  [6, 8, 7, 5, 5, 7, 3, 7],\n" +
    "  [8, 7, 3, 6, 5, 2, 9, 6],\n" +
    "  [3, 2, 6, 6, 4, 4, 4, 8],\n" +
    "  [3, 8, 5, 5, 9, 5, 7, 4],\n" +
    "  [4, 6, 4, 2, 5, 7, 6, 6],\n" +
    "  [8, 4, 2, 6, 6, 4, 4, 7],\n" +
    "  [5, 7, 3, 7, 6, 7, 4, 3],\n" +
    "]; // двумерный массив рёбер\n" +
    "\n" +
    "let minRibsTable = [\n" +
    "  [0, 0, 0, 0, 0, 0, 0, 0],\n" +
    "  [0, 0, 0, 0, 0, 0, 0, 0],\n" +
    "  [0, 0, 0, 0, 0, 0, 0, 0],\n" +
    "  [0, 0, 0, 0, 0, 0, 0, 0],\n" +
    "  [0, 0, 0, 0, 0, 0, 0, 0],\n" +
    "  [0, 0, 0, 0, 0, 0, 0, 0],\n" +
    "  [0, 0, 0, 0, 0, 0, 0, 0],\n" +
    "  [0, 0, 0, 0, 0, 0, 0, 0],\n" +
    "];\n" +
    "\n" +
    "//место для чистейшего кода в Альбукерке \n" +
    "\n" +
    "result = minRibsTable; //так нужно передать массив для проверки";

export default initialCodeTask1;