import React from 'react';

export const taskDesc = <div className={"taskDescDialog"}>
    <p>Чё каво, Альбукерке. Джесси Пинкман на связи! В этом курсе вы узнаете, как работать с массивами в JS и заодно научитесь крутому Венгерскому алгоритму.</p>
    <p>Тема в том, что в Альбукерке есть 8 основных точек, куда поставляется самый чистый товар в городе. А также есть 8 крупных поставщиков, которые за определённую цену для каждой точки доставляют свой товар. Но чтобы друг друга не перемочить, поставщики договорились, что каждый доставляет товар только в одну точку. То есть, к примеру, мой кореш старик-Хайзенберг может сделать всего 1 поставку в 1 точку точно так же, как и другие игроки рынка Альбукерки.</p>
    <p>Конечно, каждый из поставщиков хочет урвать бабла побольше, но сейчас не об этом. В этом курсе мы при помощи Венгерского алгоритма найдём, как дешевле всего доставить товар на все точки.</p>
    <p>Итак, первое задание оч простое. Надо в каждом столбце таблицы найти <b>минимальный элемент</b> и вычесть его из <b>всего столбца</b>, в котором был выбран этот элемент.</p>
    <p>Для проверки нужно передать двумерный массив весов рёбер, где уже вычтены из столбцов их минимумы.</p>
    <p><a target={"_blank"} href={"https://developer.mozilla.org/ru/docs/Web/JavaScript/Reference/Global_Objects/Array"}>Прокачать свои знания по массивам можно здесь.</a></p>
    <p><a target={"_blank"} href={"https://developer.mozilla.org/ru/docs/Web/JavaScript/Guide/%D0%A6%D0%B8%D0%BA%D0%BB%D1%8B_%D0%B8_%D0%B8%D1%82%D0%B5%D1%80%D0%B0%D1%86%D0%B8%D0%B8"}>А по циклам тут.</a></p>

    <p><img src={"https://pp.userapi.com/c845021/v845021006/2fa6e/N1hUtW7Forc.jpg"}/></p>

</div>;

export default taskDesc;